app/Controllers/Admin/AdminController.php

    public function index()
    {
        $courseModel = new Courses();
        $postModel = new Blog();
        $categoryModel = new Category();
        $tagModel = new Tag();

        // Basic counts (keep as is)
        $data1 = [
            'courseCount' => $courseModel->countAll(),
            'postCount' => $postModel->countAll(),
            'categoryCount' => $categoryModel->countAll(),
            'tagCount' => $tagModel->countAll(),
        ];

        $data2 = [
            'courses' => $courseModel->findAll(),
        ];


        // ✅ Get posts per month (for area chart)
        $postsPerMonth = $postModel->select("COUNT(id) as count, DATE_FORMAT(created_at, '%b') as month")
            ->groupBy('month')
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `blogs`
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `tags`
SELECT *
FROM `courses`
SELECT COUNT(id) as count, DATE_FORMAT(created_at, '%b') as month
FROM `blogs`
GROUP BY `month`
ORDER BY `created_at` ASC

        }

        // ✅ Get posts per category (for bar chart)
        $postsPerCategory = $categoryModel
            ->select('categories.name, COUNT(blogs.id) as post_count')
            ->join('blogs', 'blogs.category_id = categories.id', 'left')
            ->groupBy('categories.id')
            ->findAll();
---
SELECT `categories`.`name`, COUNT(blogs.id) as post_count
FROM `categories`
LEFT JOIN `blogs` ON `blogs`.`category_id` = `categories`.`id`
GROUP BY `categories`.`id`