app/Controllers/Admin/BlogAdminController.php

    public function index()
    {
        $data['blogs'] = $this->blogModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `blogs`
ORDER BY `created_at` DESC