app/Controllers/Admin/BlogCategoryController.php

    public function index()
    {
        $model = new Category();
        $data['categories'] = $model->findAll();
---
SELECT *
FROM `categories`