app/Controllers/Blog/BlogController.php

    public function index()
    {
        helper('text');

        // You can later modify this condition to check if the blog is under development
        $isUnderDevelopment = false; // Set to false to enable the blog

        if ($isUnderDevelopment) {
            return view('under_development'); // Show the under development page
        }

        $model = new Blog();

        $data['blogs'] = $model->orderBy('created_at', 'DESC')->findAll();
        $data['recentPosts'] = $model->orderBy('created_at', 'DESC')->findAll(4);

        // Get unique categories from the blogs table
        $categoryModel = new Category();
        $data['categories'] = $categoryModel->select('categories.name, categories.slug')
            ->join('blogs', 'blogs.category_id = categories.id')
            ->groupBy('categories.id')
            ->selectCount('blogs.id', 'post_count')
            ->findAll();

        $tagModel = new Tag();
        $data['tags'] = $tagModel->findAll();
---
SELECT *
FROM `blogs`
ORDER BY `created_at` DESC
SELECT *
FROM `blogs`
ORDER BY `created_at` DESC
 LIMIT 4
SELECT `categories`.`name`, `categories`.`slug`, COUNT(`blogs`.`id`) AS `post_count`
FROM `categories`
JOIN `blogs` ON `blogs`.`category_id` = `categories`.`id`
GROUP BY `categories`.`id`
SELECT *
FROM `tags`