app/Controllers/Payment/CoursePayment.php

SELECT *
FROM `users`
WHERE `id` IS NULL
---
    public function paystack()
    {
        // Get the logged-in user's ID from the session
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->route('login')->with('error', 'User not logged in.');
        }

        // Query the database to get the user's email
        $user = $this->db->table('users') // The name of your table
                        ->where('id', $userId)
                        ->get()
                        ->getRow();