app/Controllers/Courses/CourseController.php

SELECT *
FROM `courses`
WHERE `category` = 'Human Resources'
ORDER BY `id` DESC
---
    public function category($category)
    {
        helper('text'); // ✅ Load the text helper to enable word_limiter()

        $courseModel = new Courses();

        // Decode category name from URL
        $category = urldecode($category);

        // Fetch courses based on category with correct chaining
        $data['courses'] = $courseModel->where('category', $category)
                                       ->orderBy('id', 'DESC')
                                       ->findAll();

SELECT *
FROM `courses`
WHERE `courses`.`id` = '21'
SELECT *
FROM `courses`
WHERE `id` != '21'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function show($id)
    {
        helper(['text']); // for word_limiter etc.

        $courseModel = new Courses();
        $unlockModel = new UserUnlockedCourses();

        $course = $courseModel->find($id);

        if (!$course) {
            throw PageNotFoundException::forPageNotFound("Course not found");
        }

        // Optional: log view (you can store to DB or write to log file)
        log_message('info', 'Course viewed: ' . $course['title'] . ' (ID: ' . $id . ')');

        $data = [
            'course' => $course,
            '_course' => $course, // Just in case it's used in views
            'other_courses' => $courseModel
                ->where('id !=', $id)
                ->orderBy('created_at', 'DESC')
                ->findAll(5), // fetch 5 other courses