app/Controllers/Courses/CourseController.php

    public function index()
    {
        $courseModel = new Courses();

        // Fetch distinct categories
        $data['categories'] = $courseModel->select('DISTINCT(category)')->findAll();
        $data['courses'] = $courseModel->findAll(); // Fetch all courses
---
SELECT *
FROM `courses`

    public function category($category)
    {
        helper('text'); // ✅ Load the text helper to enable word_limiter()

        $courseModel = new Courses();

        // Decode category name from URL
        $category = urldecode($category);

        // Fetch courses based on category
        $data['courses'] = $courseModel->where('category', $category)->findAll();
---
SELECT *
FROM `courses`
WHERE `category` = 'User Experience'