app/Controllers/Courses/CourseController.php

    public function index()
    {
        $courseModel = new Courses();

        // Fetch distinct categories
        $data['categories'] = $courseModel->select('DISTINCT(category)')->findAll();

        // Fetch distinct topics
        // $data['topics'] = $courseModel->getTopics();

        // Fetch all courses
        $data['courses'] = $courseModel->orderBy('id', 'DESC')->findAll();

        // Fetch featured (highlighted) courses
        $data['highlighted_courses'] = $courseModel->where('is_featured', 1)->orderBy('id', 'DESC')->findAll(6);
---
SELECT DISTINCT(category)
FROM `courses`
SELECT *
FROM `courses`
ORDER BY `id` DESC
SELECT *
FROM `courses`
WHERE `is_featured` = 1
ORDER BY `id` DESC
 LIMIT 6

    public function category($category)
    {
        helper('text'); // ✅ Load the text helper to enable word_limiter()

        $courseModel = new Courses();

        // Decode category name from URL
        $category = urldecode($category);

        // Fetch courses based on category with correct chaining
        $data['courses'] = $courseModel->where('category', $category)
                                       ->orderBy('id', 'DESC')
                                       ->findAll();
---
SELECT *
FROM `courses`
WHERE `category` = 'User Experience'
ORDER BY `id` DESC

    public function allCategories()
    {
        // Load the Category model or directly fetch categories from the database
        $categoryModel = new Courses();  // Example of a model for categories

        // Fetch all categories
        $data['categories'] = $categoryModel->findAll();
---
SELECT *
FROM `courses`