app/Controllers/BaseController.php

SELECT *
FROM `system`
 LIMIT 1
SELECT *
FROM `developer`
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        $systemModel = new System();
        $this->system = $systemModel->first();

        $developerModel = new Developer();
        $this->developer = $developerModel->first();