app/Controllers/Home.php

    public function index(): string
    {
        $courses = new Courses();

        // Fetch courses from the database
        $data['courses_data'] = $courses->orderBy('id', 'DESC')->findAll();

        // Fetch distinct categories with images
        $data['categories'] = $courses->select('DISTINCT(category), image')->findAll(3);

        $aboutModel = new About();
        $data['about'] = $aboutModel->first();
---
SELECT *
FROM `about`
 LIMIT 1