app/Controllers/Home.php

SELECT *
FROM `system`
SELECT *
FROM `courses`
ORDER BY `id` DESC
 LIMIT 6
SELECT DISTINCT(category), `category_image`, `image`
FROM `courses`
 LIMIT 3
---
    public function index(): string
    {
        $system = new System();
        $data['systems '] = $system->findAll();

        $courses = new Courses();
        // Fetch courses from the database
        $data['courses_data'] = $courses->orderBy('id', 'DESC')->findAll(6);

        // Fetch distinct categories with images from the database
        $data['categories'] = $courses->select('DISTINCT(category), category_image, image')->findAll(3);

SELECT *
FROM `about`
 LIMIT 1
SELECT *
FROM `teams`
ORDER BY `id` DESC
---

        // Fetch other data for the page
        $aboutModel = new About();
        $data['about'] = $aboutModel->first();

        $teamModel = new TeamModel();
        $teams = $teamModel->orderBy('id', 'DESC')->findAll();