app/Controllers/About/AboutController.php

    public function index()
    {
        // Load the About, Service, and Topic models
        $aboutModel = new About();
        $serviceModel = new Services();
        $topicModel = new Topic(); // Load the Topic model
        $teamModel = new TeamModel(); // Load the TeamModel

        // Fetch about data from the database
        $aboutData = $aboutModel->findAll();
        $about = [];
        if (!empty($aboutData)) {
            $about = $aboutData[0]; // Assuming the about data is stored in the first row
        }

        // Fetch all services from the services table
        $services = $serviceModel->findAll();

        // Fetch all topics from the topics table
        $topics = $topicModel->findAll();

        // Fetch all team members from the team table
        $team = $teamModel->findAll();
---
SELECT *
FROM `about`
SELECT *
FROM `services`
SELECT *
FROM `topics`
SELECT *
FROM `team`